
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Отказ = Истина;
	КонецЕсли;

	Объект.Организация = Параметры.Организация;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РезультатЗапроса = ЯщикиОрганизации();
	Если Не РезультатЗапроса.Успешно Тогда
		ПоказатьПредупреждение(, РезультатЗапроса.ПредставлениеПользователю);
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из РезультатЗапроса.Данные Цикл
		
		ЗаполнитьЗначенияСвойств(ЯщикиОрганизации.Добавить(), ЭлементКоллекции);
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЯщикиОрганизации

&НаКлиенте
Процедура ЯщикиОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элемент.ТекущиеДанные.ИдентификаторЯщика);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЯщикиОрганизации()
	
	Возврат РеквизитФормыВЗначение("Объект").ИдентификаторыЯщиков();
	
КонецФункции

#КонецОбласти
