
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	Объект.Организация = Параметры.Организация;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РезультатЗапроса = СертификатыОрганизации();	
	Если Не РезультатЗапроса.Успешно Тогда
		ПоказатьПредупреждение(, РезультатЗапроса.ПредставлениеПользователю);
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из РезультатЗапроса.Данные Цикл
		
		ЗаполнитьЗначенияСвойств(Сертификаты.Добавить(), ЭлементКоллекции);
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыСертификаты

&НаКлиенте
Процедура СертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элемент.ТекущиеДанные.ОтпечатокСертификата);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СертификатыОрганизации()
	
	Возврат РеквизитФормыВЗначение("Объект").Сертификаты();
	
КонецФункции

#КонецОбласти
