
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	АвторизацияOIDC = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвторизацияOIDCПриИзменении(Элемент)
	
	Модифицированность = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(АвторизацияOIDC, Элементы.ГруппаСтраницаАвторизацииOIDC,
		Элементы.ГруппаСтраницаАвторизации);	

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОрганизацияПриИзмененииНаСервере();
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(АвторизацияOIDC, Элементы.ГруппаСтраницаАвторизацииOIDC,
		Элементы.ГруппаСтраницаАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияOIDCСсылкаНажатие(Элемент)
	
	ЗапуститьПриложение(Элемент.Заголовок);

КонецПроцедуры

&НаКлиенте
Процедура АвторизацияOIDCСсылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОтпечатокСертификатаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПарольСертификатаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура client_idПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура client_secretПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура refresh_tokenПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КлючРазработчикаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЯщикаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЯщикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОткрытьФорму("ВнешняяОбработка.КонтурДиадок_ПрограммныйИнтерфейс.Форма.ПоискЯщика", Новый Структура("Организация",
		Объект.Организация), , , , , Новый ОписаниеОповещения("ЗавершениеВыборкаЯщикаОрганизации", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОтпечатокСертификатаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ОткрытьФорму("ВнешняяОбработка.КонтурДиадок_ПрограммныйИнтерфейс.Форма.ПоискСертификата",
		Новый Структура("Организация", Объект.Организация), , , , ,
		Новый ОписаниеОповещения("ЗавершениеВыборкаОтпечаткаСертификатаОрганизации", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПарольСертификатаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоказатьСкрытьДанныеПоляВРежимеПароля(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура client_idНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоказатьСкрытьДанныеПоляВРежимеПароля(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура client_secretНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоказатьСкрытьДанныеПоляВРежимеПароля(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура refresh_tokenНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоказатьСкрытьДанныеПоляВРежимеПароля(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	Модифицированность = Ложь;
	 
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться(Команда)
		
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не заполнена организация'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Необходимо сохранить текущие значения'",
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	РезультатАвторизации = АвторизоватьсяНаСервере();
	ПрезентоватьРезультат(РезультатАвторизации);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентов(Команда)
	
	РезультатЗапроса = СписокКонтрагентовНаСервере();
	ПрезентоватьРезультат(РезультатЗапроса);
	СобратьДерево(РезультатЗапроса, "СписокКонтрагентов_ДеревоЗначений");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовПервыеДвеСтраницы(Команда)
	
	РезультатЗапроса = СписокКонтрагентовПервыеДвеСтраницыНаСервере();
	ПрезентоватьРезультат(РезультатЗапроса);
	СобратьДерево(РезультатЗапроса, "СписокКонтрагентов_ДеревоЗначений");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеВыборкаЯщикаОрганизации(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		ИдентификаторЯщика = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборкаОтпечаткаСертификатаОрганизации(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОтпечатокСертификата = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрезентоватьРезультат(РезультатВыполнения, ПрезентоватьУспешноеВыполнение = Истина)
	
	Если Не РезультатВыполнения.Успешно Тогда
		ПоказатьПредупреждение( , РезультатВыполнения.ПредставлениеПользователю);
	Иначе
		Если ПрезентоватьУспешноеВыполнение 
			И Не ПустаяСтрока(РезультатВыполнения.ПредставлениеПользователю) Тогда
			ПоказатьОповещениеПользователя(РезультатВыполнения.ПредставлениеПользователю);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЭтоНеПустаяСсылка = ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект.Организация)) И ЗначениеЗаполнено(Объект.Организация);
	Если Не (ЭтоНеПустаяСсылка Или ТипЗнч(Объект.Организация) = Тип("Строка")) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	ORGANIZATION_INFO = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		Объект.Организация, "Контур_ПрограммныйИнтерфейс_ДанныеОрганизации");
	УстановитьПривилегированныйРежим(Ложь);

	Если ORGANIZATION_INFO = Неопределено Тогда
		ORGANIZATION_INFO = РеквизитФормыВЗначение("Объект").Контракт_ORGANIZATION_INFO();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ORGANIZATION_INFO);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]);

	Если Не ЗначениеЗаполнено(ИНН) Тогда
		ИНН = ИННОрганизацииНаСервере(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИННОрганизацииНаСервере(Организация)
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Организация)) Тогда
		
		Попытка
			//@skip-check bsl-legacy-check-string-literal
			ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
		Исключение
			ИНН = "";
		КонецПопытки;
		
	Иначе
		
		СтруктураРеквизитов = Новый Структура("ИНН", "");
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Организация);
		ИНН = СтруктураРеквизитов["ИНН"];
		
	КонецЕсли;
	
	Возврат ИНН;
	
КонецФункции

&НаСервере
Процедура СохранитьНаСервере()

	ORGANIZATION_INFO = РеквизитФормыВЗначение("Объект").Контракт_ORGANIZATION_INFO();
	ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]["refresh_token"] = refresh_token;
	ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]["client_id"] = client_id;
	ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]["client_secret"] = client_secret;
	
	ORGANIZATION_INFO["ОтпечатокСертификата"] = ОтпечатокСертификата;
	ORGANIZATION_INFO["ПарольСертификата"] = ПарольСертификата;
	ORGANIZATION_INFO["АвторизацияOIDC"] = АвторизацияOIDC;
	ORGANIZATION_INFO["КлючРазработчика"] = КлючРазработчика;
	ORGANIZATION_INFO["ИдентификаторЯщика"] = ИдентификаторЯщика;
	
	ORGANIZATION_INFO["ИНН"] = ИНН;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Организация, ORGANIZATION_INFO,
		"Контур_ПрограммныйИнтерфейс_ДанныеОрганизации");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция АвторизоватьсяНаСервере()
	
	Возврат РеквизитФормыВЗначение("Объект").Авторизоваться();

КонецФункции

&НаСервере
Функция СписокКонтрагентовНаСервере()
	
	ПараметрыЗапроса = Новый Структура();
	Возврат РеквизитФормыВЗначение("Объект").СписокКонтрагентов(ПараметрыЗапроса);
	
КонецФункции

&НаСервере
Функция СписокКонтрагентовПервыеДвеСтраницыНаСервере()
	
	ЭкземплярИнтерфейса = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗапроса = Новый Структура();
	//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
	РезультатЗапросаСпискаКонтрагентов = ЭкземплярИнтерфейса.СписокКонтрагентов(ПараметрыЗапроса);
	Пока РезультатЗапросаСпискаКонтрагентов.Успешно Цикл
		
		Если Не РезультатЗапросаСпискаКонтрагентов.Данные.ЕстьЕще Тогда
			Прервать;
		КонецЕсли;
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		РезультатЗапросаСпискаКонтрагентов = ЭкземплярИнтерфейса.СписокКонтрагентовСледующаяПорция(
			РезультатЗапросаСпискаКонтрагентов);
		
		// По условию прерываем после обработки второй страницы
		// чтобы не было затяжного исполнения кода
		Прервать;
		
	КонецЦикла;
	
	Возврат РезультатЗапросаСпискаКонтрагентов;
	
КонецФункции
// Ограничивает доступ к форме полноправными пользователями и задаёт способ авторизации по умолчанию.

&НаКлиенте
Процедура СобратьДерево(РезультатЗапроса, ИмяДереваЗначений)
	
	Если Не РезультатЗапроса.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьСборкуДереваЗначенийНаСервере(РезультатЗапроса.Данные.Контрагенты, ИмяДереваЗначений);
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьСборкуДереваЗначенийНаСервере(РезультатЗапроса, ИмяДереваЗначений)
	
	ДеревоФормы = РеквизитФормыВЗначение(ИмяДереваЗначений);
	ДеревоФормы.Строки.Очистить();
	
	СобратьУровеньДерева(ДеревоФормы, РезультатЗапроса);	
	
	ЗначениеВРеквизитФормы(ДеревоФормы, ИмяДереваЗначений);
	
КонецПроцедуры

&НаСервере
Процедура СобратьУровеньДерева(Родитель, Данные)
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		
		Для Индекс = 0 По Данные.ВГраница() Цикл
			// "ЭлементКоллекции[i]" - контейнер значения, для визуального разграничения подстрок уровня
			ДобавитьУзелДерева(Родитель, СтрШаблон("ЭлементКоллекции[%1]", Строка(Индекс + 1)), Данные[Индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		
		Для Каждого Элемент Из Данные Цикл
			ДобавитьУзелДерева(Родитель, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУзелДерева(Родитель, ИмяУзла, Значение)
	
	СтрокаДерева = Родитель.Строки.Добавить();
	СтрокаДерева.Ключ = ИмяУзла;
	
	Если ТипЗнч(Значение) = Тип("Массив") Или ТипЗнч(Значение) = Тип("Структура") Тогда
		СобратьУровеньДерева(СтрокаДерева, Значение);
	Иначе
		СтрокаДерева.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьДанныеПоляВРежимеПароля(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элемент.РежимПароля = ?(Элемент.РежимПароля = Неопределено, Ложь, Не Элемент.РежимПароля);	
	Элемент.КартинкаКнопкиВыбора = ?(Элемент.РежимПароля,
		БиблиотекаКартинок.ПоказатьПароль, БиблиотекаКартинок.СкрытьПароль);
	
КонецПроцедуры

#КонецОбласти

