
//@skip-check bsl-legacy-check-string-literal

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	АвторизацияOIDC = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвторизацияOIDCПриИзменении(Элемент)
	
	Модифицированность = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(АвторизацияOIDC, Элементы.ГруппаСтраницаАвторизацииOIDC,
		Элементы.ГруппаСтраницаАвторизации);	

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОрганизацияПриИзмененииНаСервере();
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(АвторизацияOIDC, Элементы.ГруппаСтраницаАвторизацииOIDC,
		Элементы.ГруппаСтраницаАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияOIDCСсылкаНажатие(Элемент)
	
	ЗапуститьПриложение(Элемент.Заголовок);

КонецПроцедуры

&НаКлиенте
Процедура АвторизацияOIDCСсылкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОтпечатокСертификатаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПарольСертификатаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура client_idПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура client_secretПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура refresh_tokenПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КлючРазработчикаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиПоИНН(Команда)
	
	НайтиПоИНННаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Модифицированность = Ложь;
	СохранитьНаСервере();
	 
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться(Команда)
		
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не заполнена организация'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Необходимо сохранить текущие значения'",
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	РезультатАвторизации = АвторизоватьсяНаСервере();
	ПрезентоватьРезультат(РезультатАвторизации);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрезентоватьРезультат(РезультатВыполнения, ПрезентоватьУспешноеВыполнение = Истина)
	
	Если Не РезультатВыполнения.Успешно Тогда
		ПоказатьПредупреждение( , РезультатВыполнения.ПредставлениеПользователю);
	Иначе
		Если ПрезентоватьУспешноеВыполнение И Не ПустаяСтрока(РезультатВыполнения.ПредставлениеПользователю) Тогда
			ПоказатьПредупреждение( , РезультатВыполнения.ПредставлениеПользователю);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЭтоНеПустаяСсылка = ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект.Организация)) И ЗначениеЗаполнено(Объект.Организация);
	Если Не (ЭтоНеПустаяСсылка Или ТипЗнч(Объект.Организация) = Тип("Строка")) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ORGANIZATION_INFO = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			Объект.Организация, "Контур_ПрограммныйИнтерфейс_ДанныеОрганизации");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ORGANIZATION_INFO = Неопределено Тогда
		ORGANIZATION_INFO = РеквизитФормыВЗначение("Объект").Контракт_ORGANIZATION_INFO();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ORGANIZATION_INFO);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]);
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		ИНН = ИННОрганизацииНаСервере(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИННОрганизацииНаСервере(Организация)
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Организация)) Тогда
		
		Попытка
			ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
		Исключение
			ИНН = "";
		КонецПопытки;
		
	Иначе
		
		СтруктураРеквизитов = Новый Структура("ИНН", "");
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Организация);
		ИНН = СтруктураРеквизитов["ИНН"];
		
	КонецЕсли;
	
	Возврат ИНН;
	
КонецФункции

&НаСервере
Процедура НайтиПоИНННаСервере()
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	Сертификат = РеквизитФормыВЗначение("Объект").СертификатПоИНН(ИНН);
	ОтпечатокСертификата = ?(Сертификат = Неопределено, "", НРег(ПолучитьHexСтрокуИзДвоичныхДанных(
		Сертификат.Отпечаток)));
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()

	ORGANIZATION_INFO = РеквизитФормыВЗначение("Объект").Контракт_ORGANIZATION_INFO();
	ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]["refresh_token"] = refresh_token;
	ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]["client_id"] = client_id;
	ORGANIZATION_INFO["ДанныеАвторизацииOIDC"]["client_secret"] = client_secret;
	
	ORGANIZATION_INFO["ОтпечатокСертификата"] = ОтпечатокСертификата;
	ORGANIZATION_INFO["ПарольСертификата"] = ПарольСертификата;
	ORGANIZATION_INFO["АвторизацияOIDC"] = АвторизацияOIDC;
	ORGANIZATION_INFO["КлючРазработчика"] = КлючРазработчика;
	
	ORGANIZATION_INFO["ИНН"] = ИНН;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Организация, ORGANIZATION_INFO,
		"Контур_ПрограммныйИнтерфейс_ДанныеОрганизации");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция АвторизоватьсяНаСервере()
	
	ЭкземплярИнтерфейса = РеквизитФормыВЗначение("Объект");
	Возврат ЭкземплярИнтерфейса.Авторизоваться();

КонецФункции

#КонецОбласти

