// Copyright 2026 Alexander Smirnov
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/1ncluderu/kontur.diadoc-http-api-1C
// e-mail: fen1xfsg@ymail.com
// Версия: -

//@skip-check undefined-variable

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Модуль_КоннекторHTTP;

#Область БазовыеОбъекты

Перем CURRENT_ORGANIZATION;
Перем CURRENT_CERTIFICATE;
Перем CURRENT_CERTIFICATE_PASSWORD;

Перем CURRENT_ACESS_TOKEN;

#КонецОбласти

#Область КонстантыДополнительнойИнформации

Перем ORGANIZATION_INFO;

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Версия интерфейса.
// 
// Возвращаемое значение:
//  Строка - Версия интерфейса
Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "1";
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура Авторизоваться() Экспорт
	 
	ИнициализироватьОкружение();
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Криптография

Функция МенеджерКриптографии_Новый()
	
	ПутиМодуляКриптографии = Новый Соответствие();
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.Linux_x86, "/opt/cprocsp/lib/ia32/libcapi20.so:/opt/cprocsp/lib/ia32/libcapi10.so");
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.Linux_x86_64, "/opt/cprocsp/lib/amd64/libcapi20.so:/opt/cprocsp/lib/amd64/libcapi10.so");
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.MacOS_x86, "/opt/cprocsp/lib/libcapi20.dylib:/opt/cprocsp/lib/libcapi10.dylib");
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.MacOS_x86_64, "/opt/cprocsp/lib/libcapi20.dylib:/opt/cprocsp/lib/libcapi10.dylib");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПутьМодуляКриптографии = ПутиМодуляКриптографии[СистемнаяИнформация.ТипПлатформы];
	Если ПутьМодуляКриптографии = Неопределено Тогда
		ПутьМодуляКриптографии = "";
	КонецЕсли;
	
	НовыйМенеджерКриптографии = Новый МенеджерКриптографии("", ПутьМодуляКриптографии, 80, ИспользованиеИнтерактивногоРежимаКриптографии.НеИспользовать);
	
	Если ЗначениеЗаполнено(CURRENT_CERTIFICATE_PASSWORD) Тогда
		НовыйМенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = CURRENT_CERTIFICATE_PASSWORD;
	КонецЕсли;
	 
	Возврат НовыйМенеджерКриптографии;

КонецФункции

Функция МенеджерКриптографии_Подписать(ДвоичныеДанные)

	МенеджерКриптографии = МенеджерКриптографии_Новый();
	Возврат МенеджерКриптографии.Подписать(ДвоичныеДанные, CURRENT_CERTIFICATE);
	
КонецФункции

Функция МенеджерКриптографии_Расшифровать(ДвоичныеДанные)

	МенеджерКриптографии = МенеджерКриптографии_Новый();
	Возврат МенеджерКриптографии.Расшифровать(ДвоичныеДанные, CURRENT_CERTIFICATE);
	
КонецФункции

Функция МенеджерКриптографии_СертификатПоОтпечатку(ОтпечатокСертификата)
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("Строка") Тогда
		ОтпечатокСертификата = ПолучитьДвоичныеДанныеИзHexСтроки(ОтпечатокСертификата);
	КонецЕсли;
	
	Если ПустаяСтрока(ОтпечатокСертификата) Тогда
		Если ВызыватьИсключения Тогда
			ВызватьИсключение("Не указан отпечаток сертификата");
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не указан отпечаток сертификата");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		МенеджерКриптографии = МенеджерКриптографии_Новый();
		ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов(
			ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		Сертификат = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
		
	Исключение
		Сертификат = Неопределено;
	КонецПопытки;
	
	Возврат Сертификат;
	
КонецФункции

Функция МенеджерКриптографии_СертификатПоИНН(ИНН)
	
	МенеджерКриптографии = МенеджерКриптографии_Новый();
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов(
		ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	
	СертификатыПоСубъекту = ХранилищеСертификатовКриптографии.НайтиПоСубъекту(ИНН);
	Если СертификатыПоСубъекту.Количество() = 0 Тогда
		Если ВызыватьИсключения Тогда
			ВызватьИсключение("Неудалось найти сертификаты организации");
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Неудалось найти сертификаты организации");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// Заполняем ТаблицаЗначений для сортировки
	Сертификаты = Новый ТаблицаЗначений;
	Сертификаты.Колонки.Добавить("Сертификат");
	Сертификаты.Колонки.Добавить("ДатаОкончания");
	
	Для Каждого Сертификат Из СертификатыПоСубъекту Цикл
		
		НоваяСтрока = Сертификаты.Добавить();
		НоваяСтрока.Сертификат = Сертификат;
		НоваяСтрока.ДатаОкончания = Сертификат.ДатаОкончания;
		
	КонецЦикла;
	
	Сертификаты.Сортировать("ДатаОкончания УБЫВ");
	
	Возврат ?(Сертификаты.Количество(), Сертификаты[0].Сертификат, Неопределено);
	
КонецФункции

#КонецОбласти

#Область Окружение

Процедура ОчиститьОкружение()
	
	CURRENT_ORGANIZATION = Неопределено;
	CURRENT_CERTIFICATE = Неопределено;
	CURRENT_CERTIFICATE_PASSWORD = Неопределено;
	
	CURRENT_ACESS_TOKEN = Неопределено;
	
	ORGANIZATION_INFO = Неопределено;
	
КонецПроцедуры

Процедура ИнициализироватьОкружение()
	
	Если CURRENT_ORGANIZATION <> Организация Тогда
	
		ОчиститьОкружение();
		Если Не ЗначениеЗаполнено(Организация) Тогда
			ВызватьИсключение(НСтр("ru = 'Не указана организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		CURRENT_ACESS_TOKEN = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			Организация, "Контур_ПрограммныйИнтерфейс_ТокенДоступа");
		
		ORGANIZATION_INFO = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			Организация, "Контур_ПрограммныйИнтерфейс_ДанныеОрганизации");
		
		УстановитьПривилегированныйРежим(Ложь);	
		
		Если CURRENT_ACESS_TOKEN = Неопределено Тогда
			CURRENT_ACESS_TOKEN = Контракт_CURRENT_ACESS_TOKEN();	
		КонецЕсли;
		
		CURRENT_ORGANIZATION = Организация;
		
		Если ORGANIZATION_INFO = Неопределено Тогда
			ORGANIZATION_INFO = Контракт_ORGANIZATION_INFO();
		КонецЕсли;
		
		CURRENT_CERTIFICATE_PASSWORD = ORGANIZATION_INFO.ПарольСертификата;
		
		Если ЗначениеЗаполнено(ORGANIZATION_INFO.ОтпечатокСертификата) Тогда
		
			CURRENT_CERTIFICATE = МенеджерКриптографии_СертификатПоОтпечатку(ORGANIZATION_INFO.ОтпечатокСертификата);
		
		ИначеЕсли ЗначениеЗаполнено(ORGANIZATION_INFO.ИНН) Тогда
			
			CURRENT_CERTIFICATE = МенеджерКриптографии_СертификатПоИНН(ORGANIZATION_INFO.ИНН);
			
		КонецЕсли;		
		
	КонецЕсли;	

КонецПроцедуры

#Область Контракты

Функция Контракт_ORGANIZATION_INFO() Экспорт
	
	ДанныеАвторизацииOIDC = Новый Структура();
	ДанныеАвторизацииOIDC.Вставить("refresh_token", Неопределено);
	ДанныеАвторизацииOIDC.Вставить("client_id", Неопределено);
	ДанныеАвторизацииOIDC.Вставить("client_secret", Неопределено);
	
	НовыйКонтракт = Новый Структура();
	НовыйКонтракт.Вставить("ОтпечатокСертификата", Неопределено);
	НовыйКонтракт.Вставить("ПарольСертификата", Неопределено);
	НовыйКонтракт.Вставить("АвторизацияOIDC", Истина); // Актуальный на данные момент
	НовыйКонтракт.Вставить("ДанныеАвторизацииOIDC", ДанныеАвторизацииOIDC);
	НовыйКонтракт.Вставить("КлючРазработчика", Неопределено); // Для устаревшего варианта авторизации
	
	НовыйКонтракт.Вставить("ИНН", Неопределено);
	
	Возврат НовыйКонтракт;
	
КонецФункции

Функция Контракт_CURRENT_ACESS_TOKEN()
	
	Возврат Новый Структура("acess_token,expire_date", Неопределено, '00010101');
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область Инициализация

Если Модуль_КоннекторHTTP = Неопределено Тогда
	
	ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий();
	ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ПолучитьМакет("КоннекторHTTP").Получить(), Новый УникальныйИдентификатор());
	ИмяЭкземпляра = ВнешниеОбработки.Подключить(АдресВХранилище, "КоннекторHTTP", Ложь, ЗащитаОтОпасныхДействий, );
	
	Модуль_КоннекторHTTP = ВнешниеОбработки.Создать(ИмяЭкземпляра, Ложь, ЗащитаОтОпасныхДействий);
		
КонецЕсли;

#КонецОбласти

#КонецЕсли