// Copyright 2026 Alexander Smirnov
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL:    https://github.com/1ncluderu/kontur.diadoc-http-api-1C
// e-mail: fen1xfsg@ymail.com
// Версия: -

//@skip-check bsl-variable-name-invalid
//@skip-check constructor-function-return-section
//@skip-check method-too-many-params
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#Область СлужебныеПеременные

Перем КЭШ;

Перем Модуль_КоннекторHTTP;
Перем СессияКоннектор;

#КонецОбласти

#Область ОсновныеПеременныеОкружения

Перем CURRENT_ORGANIZATION;

Перем ORGANIZATION_INFO;

Перем CURRENT_CERTIFICATE;
Перем CURRENT_CERTIFICATE_PASSWORD;

Перем CURRENT_ACCESS_TOKEN;

#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выполняет авторизацию в сервисе Контур.Диадок и сохраняет токен доступа.
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода 
Функция Авторизоваться() Экспорт

	ПродлеватьТокен = Ложь;
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода(ПродлеватьТокен);
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;

	Если ORGANIZATION_INFO.АвторизацияOIDC Тогда

		РезультатВыполненияМетодаHTTP = Connect(
			ORGANIZATION_INFO.ДанныеАвторизацииOIDC.client_id, 
			ORGANIZATION_INFO.ДанныеАвторизацииOIDC.client_secret,
			ORGANIZATION_INFO.ДанныеАвторизацииOIDC.refresh_token);
	
	Иначе
		// Метод устарел, следует использовать OIDC авторизацию
		РезультатВыполненияМетодаHTTP = V3_Authenticate();
		Если РезультатВыполненияМетодаHTTP.Успешно Тогда
			РезультатВыполненияМетодаHTTP = V3_AuthenticateConfirm(
				Base64Строка(МенеджерКриптографии_Расшифровать(РезультатВыполненияМетодаHTTP.Данные)));
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатВыполненияМетодаHTTP.Успешно Тогда	
		
		CURRENT_ACCESS_TOKEN = Контракт_CURRENT_ACCESS_TOKEN();
		CURRENT_ACCESS_TOKEN.expire_date = ТекущаяДатаСеанса() + 43200;
		CURRENT_ACCESS_TOKEN.access_token = ?(ORGANIZATION_INFO.АвторизацияOIDC,
			РезультатВыполненияМетодаHTTP.Данные.access_token,
			ПолучитьСтрокуИзДвоичныхДанных(РезультатВыполненияМетодаHTTP.Данные));
		
		СохранитьТокен();
		
	КонецЕсли;
	
	Возврат РезультатHttpВРезультатМетода(РезультатВыполненияМетодаHTTP, "Выполнено успешно");
	
КонецФункции

#Область Работа_с_контрагентами

// Возвращает информацию о контрагенте по идентификатору его ящика.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * ИдентификаторЯщикаКонтрагента - Строка - идентификатор ящика контрагента
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция ИнформацияОКонтрагенте(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	РезультатВыполненияМетодаHTTP = V3_GetCounteragent(ПараметрыМетода.ИдентификаторЯщикаКонтрагента);
	Возврат РезультатHttpВРезультатМетода(РезультатВыполненияМетодаHTTP, "Выполнено успешно");
	
КонецФункции

// Возвращает сертификаты контрагента по идентификатору его ящика.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * ИдентификаторЯщикаКонтрагента - Строка - идентификатор ящика контрагента
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция СертификатыКонтрагента(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	РезультатВыполненияМетодаHTTP = V2_GetCounteragentCertificates(ПараметрыМетода.ИдентификаторЯщикаКонтрагента);
	Возврат РезультатHttpВРезультатМетода(РезультатВыполненияМетодаHTTP, "Выполнено успешно");
	
КонецФункции

#Область ПоискКонтрагентов_Организаций

// Возвращает организацию, найденную по одному из указанных идентификаторов.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса. Достаточно указать один из идентификаторов:
//     * ИдентификаторОрганизации - Строка - (необязательный) идентификатор организации
//     * ИдентификаторЯщика - Строка - (необязательный) идентификатор ящика
//     * ИдентификаторУчастникаЭДО - Строка - (необязательный) идентификатор участника ЭДО
//     * ИНН - Строка - (необязательный) ИНН организации
//     * КПП - Строка - (необязательный) КПП организации, используется вместе с ИНН
//     * КодИностранногоНалогоПлательщика - Строка - (необязательный) код иностранного налогоплательщика
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция Организация(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	orgId = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "ИдентификаторОрганизации", Неопределено);
	boxId = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "ИдентификаторЯщика", Неопределено);
	fnsParticipantId = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "ИдентификаторУчастникаЭДО", Неопределено);
	inn = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "ИНН", Неопределено);
	kpp = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "КПП", Неопределено);
	foreignTaxpayerCode = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "КодИностранногоНалогоПлательщика", Неопределено);
	
	Если ЗначениеЗаполнено(orgId) Тогда
		
		РезультатВыполненияМетодаHTTP = GetOrganization(orgId, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено);
		
	ИначеЕсли ЗначениеЗаполнено(boxId) Тогда
		
		РезультатВыполненияМетодаHTTP = GetOrganization(Неопределено, boxId, Неопределено, Неопределено, Неопределено, Неопределено);
		 
	ИначеЕсли ЗначениеЗаполнено(fnsParticipantId) Тогда
		
		РезультатВыполненияМетодаHTTP = GetOrganization(Неопределено, Неопределено, fnsParticipantId, Неопределено, Неопределено, Неопределено);
		
	ИначеЕсли ЗначениеЗаполнено(inn) Тогда
		
		РезультатВыполненияМетодаHTTP = GetOrganization(Неопределено, Неопределено, Неопределено, inn, kpp, Неопределено);
		
	ИначеЕсли ЗначениеЗаполнено(foreignTaxpayerCode) Тогда
		
		РезультатВыполненияМетодаHTTP = GetOrganization(Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, foreignTaxpayerCode);
		
	КонецЕсли;
	
	Возврат РезультатHttpВРезультатМетода(РезультатВыполненияМетодаHTTP, "Выполнено успешно");	
	
КонецФункции

// Возвращает организации, найденные по ИНН и КПП.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * ИНН - Строка - ИНН организации
//     * КПП - Строка - (необязательный) КПП организации
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция ОрганизацииПоИннКпп(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	inn = ПараметрыМетода.ИНН;
	kpp = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "КПП", Неопределено);
	
	РезультатВыполненияМетодаHTTP = GetOrganizationsByInnKpp(inn, kpp);
	
	Возврат РезультатHttpВРезультатМетода(РезультатВыполненияМетодаHTTP, "Выполнено успешно");
	
КонецФункции

// Возвращает организации по списку ИНН.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * ИНН - Строка, Массив из Строка - ИНН организации или список ИНН
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция ОрганизацииПоИНН(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	ПереченьИНН = ПараметрыМетода.ИНН;
	Если ТипЗнч(ПереченьИНН) <> Тип("Массив") Тогда
		ПереченьИНН = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыМетода.ИНН);
	КонецЕсли;
	
	ТелоЗапроса = Новый Структура("InnList", ПереченьИНН);
	РезультатВыполненияМетодаHTTP = V2_GetOrganizationsByInnList(ТелоЗапроса);
	
	ТекстПрезентера = "Выполнено успешно";
	РезультатВыполненияМетода = РезультатВыполненияМетода(
		РезультатВыполненияМетодаHTTP.Успешно, 
		?(РезультатВыполненияМетодаHTTP.Успешно, ТекстПрезентера, РезультатВыполненияМетодаHTTP.Данные),
		?(РезультатВыполненияМетодаHTTP.Успешно, РезультатВыполненияМетодаHTTP.Данные, Неопределено));
	
	Возврат РезультатВыполненияМетода;
	
КонецФункции

// Возвращает данные ящика по его идентификатору.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * ИдентификаторЯщика - Строка - идентификатор ящика
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция ДанныеЯщика(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	boxId = ПараметрыМетода.ИдентификаторЯщика;
	РезультатВыполненияМетодаHTTP = GetBox(boxId);
	
	ТекстПрезентера = "Выполнено успешно";
	РезультатВыполненияМетода = РезультатВыполненияМетода(
		РезультатВыполненияМетодаHTTP.Успешно, 
		?(РезультатВыполненияМетодаHTTP.Успешно, ТекстПрезентера, РезультатВыполненияМетодаHTTP.Данные),
		?(РезультатВыполненияМетодаHTTP.Успешно, РезультатВыполненияМетодаHTTP.Данные, Неопределено));
	
	Возврат РезультатВыполненияМетода;
	
КонецФункции

// Возвращает или создает роуминговую организацию по идентификатору участника ЭДО.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * ИдентификаторУчастникаЭДО - Строка - идентификатор участника ЭДО
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода
Функция РоуминговаяОрганизацияПоИдентификаторуУчастникаЭДО(ПараметрыМетода) Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;
	
	FnsParticipantId = СокрЛП(ПараметрыМетода.ИдентификаторУчастникаЭДО);
	Если ВРег(Лев(FnsParticipantId, 3)) = "2BM" Тогда
		Возврат РезультатВыполненияМетода(Ложь, "Передан идентификатор текущего оператора ЭДО.");
	КонецЕсли;
	
	ТелоЗапроса = Новый Структура("FnsParticipantId", FnsParticipantId);
	РезультатВыполненияМетодаHTTP = GetOrCreateRoamingOrganizationByFnsParticipantId(ТелоЗапроса);
	
	Возврат РезультатHttpВРезультатМетода(РезультатВыполненияМетодаHTTP, "Выполнено успешно");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СписокКонтрагентов

// Возвращает список контрагентов организации с возможностью постраничного получения.
//
// Параметры:
//   ПараметрыМетода - Структура - параметры запроса:
//     * СтатусКонтрагента - Строка - (необязательный) статус контрагента ("IsMyCounteragent", "InvitesMe", "IsInvitedByMe", "Rejected")
//     * ИдентификаторСледующейПорции - Строка - (необязательный) ключ для постраничного получения списка
//     * СтрокаПоиска - Строка - (необязательный) текст для поиска по наименованию или ИНН
//     * РазмерСтраницы - Число - (необязательный) размер страницы, от 1 до 100
//
// Возвращаемое значение:
//   см. РезультатВыполненияМетода 
Функция СписокКонтрагентов(ПараметрыМетода) Экспорт

	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;

	ПолныйСписок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "ПолныйСписок", Новый Массив());

	counteragentStatus = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "СтатусКонтрагента", Неопределено);
	afterIndexKey = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "ИдентификаторСледующейПорции", Неопределено);
	query = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "СтрокаПоиска", Неопределено);
	pageSize = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыМетода, "РазмерСтраницы", Неопределено);

	Если pageSize <> Неопределено И (pageSize > 100 Или pageSize < 1) Тогда
		pageSize = Неопределено;
	КонецЕсли;

	РезультатВыполненияМетодаHTTP = V3_GetCounteragents(counteragentStatus, afterIndexKey, query, pageSize);
	Если РезультатВыполненияМетодаHTTP.Успешно Тогда
		
		РезультатЗапроса = РезультатВыполненияМетодаHTTP.Данные;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПолныйСписок, РезультатЗапроса.Counteragents);

		ПараметрыЗапросаСледующейПорции = Новый Структура();
		ПараметрыЗапросаСледующейПорции.Вставить("СтатусКонтрагента", counteragentStatus);
		ПараметрыЗапросаСледующейПорции.Вставить("ИдентификаторСледующейПорции", ?(
		РезультатЗапроса.Counteragents.Количество(),
			РезультатЗапроса.Counteragents[РезультатЗапроса.Counteragents.ВГраница()].IndexKey, afterIndexKey));

		СписокКонтрагентов = Новый Структура();
		СписокКонтрагентов.Вставить("Контрагенты", ПолныйСписок);
		СписокКонтрагентов.Вставить("ЕстьЕще", РезультатЗапроса.TotalCount <> 0);
		СписокКонтрагентов.Вставить("ПараметрыЗапросаСледующейПорции", ПараметрыЗапросаСледующейПорции);
		
		РезультатВыполненияМетода = РезультатВыполненияМетода(
			РезультатВыполненияМетодаHTTP.Успешно,
			"Выполнено успешно",
			СписокКонтрагентов);
		
	Иначе
		РезультатВыполненияМетода = РезультатВыполненияМетода(
			РезультатВыполненияМетодаHTTP.Успешно,
			РезультатВыполненияМетодаHTTP.Данные);	
	КонецЕсли;
	
	Возврат РезультатВыполненияМетода;

КонецФункции

// Возвращает следующую порцию списка контрагентов на основании результата предыдущего запроса.
//
// Параметры:
//   РезультатЗапросаСпискаКонтрагентов - Структура - результат предыдущего вызова метода СписокКонтрагентов
//
// Возвращаемое значение:
//   см. СписокКонтрагентов
Функция СписокКонтрагентовСледующаяПорция(РезультатЗапросаСпискаКонтрагентов) Экспорт

	Если Не РезультатЗапросаСпискаКонтрагентов.Данные.ПараметрыЗапросаСледующейПорции.Свойство("ПолныйСписок") Тогда
		РезультатЗапросаСпискаКонтрагентов.Данные.ПараметрыЗапросаСледующейПорции.Вставить(
			"ПолныйСписок", Новый Массив());
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		РезультатЗапросаСпискаКонтрагентов.Данные.ПараметрыЗапросаСледующейПорции.ПолныйСписок,
		РезультатЗапросаСпискаКонтрагентов.Данные.Контрагенты);

	Возврат СписокКонтрагентов(РезультатЗапросаСпискаКонтрагентов.Данные.ПараметрыЗапросаСледующейПорции);

КонецФункции

#КонецОбласти

#Область СписокДокументов

// Возвращает структуру с параметрами фильтрации списка документов.
//
// Возвращаемое значение:
//   Структура - параметры фильтрации:
//     * Категория - Строка - категория документов в формате <DocumentType>.<DocumentClass><DocumentStatus>
//     * ПоискПоДатамДокумента - Булево - Истина, если поиск выполняется по датам документа, иначе по меткам времени
//     * Контрагент - Структура - данные контрагента:
//         ** ИНН - Строка - ИНН контрагента
//         ** КПП - Строка - КПП контрагента
//         ** ИдентификаторЯщика - Строка - идентификатор ящика контрагента
//     * НачалоПериода - Дата - начало периода поиска
//     * КонецПериода - Дата - конец периода поиска
//     * ПодразделениеОтправителя - Строка, Неопределено - (необязательный) подразделение отправителя
//     * ПодразделениеПолучателя - Строка, Неопределено - (необязательный) подразделение получателя
//     * НомерПервичногоДокумента - Строка, Неопределено - (необязательный) номер первичного документа
//     * ПодразделениеПоиска - Строка, Неопределено - (необязательный) подразделение, в котором выполняется поиск
//     * ИдентификаторСледующейПорции - Строка, Неопределено - (необязательный) ключ для постраничного получения
//     * ИсключитьДочерниеПодразделенияПриПоиске - Булево - Истина, если из поиска исключаются дочерние подразделения
//     * ПорядокСортировки - Строка - порядок сортировки: "ВОЗР" или "УБЫВ"
//     * РазмерПорции - Число - размер страницы  
Функция Контракт_СписокДокументов() Экспорт
	
	Контрагент = Новый Структура();
	Контрагент.Вставить("ИНН", "");
	Контрагент.Вставить("КПП", "");
	Контрагент.Вставить("ИдентификаторЯщика", "");
	
	Контракт_СписокДокументов = Новый Структура();
	Контракт_СписокДокументов.Вставить("Категория", "Any.Inbound");
	Контракт_СписокДокументов.Вставить("ПоискПоДатамДокумента", Истина); // Если ложь, поиск идет по меткам времени
	Контракт_СписокДокументов.Вставить("Контрагент", Контрагент); 
	Контракт_СписокДокументов.Вставить("НачалоПериода", '00010101');
	Контракт_СписокДокументов.Вставить("КонецПериода", '00010101');
	Контракт_СписокДокументов.Вставить("ПодразделениеОтправителя", Неопределено);
	Контракт_СписокДокументов.Вставить("ПодразделениеПолучателя", Неопределено);
	Контракт_СписокДокументов.Вставить("НомерПервичногоДокумента", Неопределено);
	Контракт_СписокДокументов.Вставить("ПодразделениеПоиска", Неопределено);
	Контракт_СписокДокументов.Вставить("ИсключитьДочерниеПодразделенияПриПоиске", Истина);
	Контракт_СписокДокументов.Вставить("ИдентификаторСледующейПорции", Неопределено);
	Контракт_СписокДокументов.Вставить("ПорядокСортировки", "ВОЗР"); // "ВОЗР" или "УБЫВ"
	Контракт_СписокДокументов.Вставить("РазмерПорции", 100);
	
	Возврат Контракт_СписокДокументов;
	
КонецФункции
  
Функция СписокДокументов(ПараметрыМетода) Экспорт
	
		
	
КонецФункции

Функция СписокДокументовСледующаяПорция(РезультатЗапросаСпискаДокументов) Экспорт
	// TO DO
КонецФункции

#КонецОбласти

#Область СписокСобытий

Функция ЛентаСобытий(ПараметрыМетода) Экспорт
	// TO DO
КонецФункции

Функция ЛентаСобытийСледующаяПорция(РезультатЗапросаЛентыСобытий) Экспорт
	// TO DO
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает версию интерфейса обработки.
//
// Возвращаемое значение:
//   Строка - версия интерфейса
Функция ВерсияИнтерфейса() Экспорт

	Возврат "1";

КонецФункции

// Возвращает список сертификатов организации с описанием их свойств.
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - Истина, если сертификаты получены
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Массив из Структура, Неопределено - описание сертификатов:
//         ** ДатаНачалаДействия - Дата - дата начала действия сертификата
//         ** ДатаОкончанияДействия - Дата - дата окончания действия сертификата
//         ** ОтпечатокСертификата - Строка - отпечаток сертификата
//         ** ЮридическоеЛицо - Строка - наименование юридического лица
//         ** ФИО - Строка - ФИО владельца сертификата
Функция Сертификаты() Экспорт

	ПродлеватьТокен = Ложь;
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода(ПродлеватьТокен);
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;

	Сертификаты = МенеджерКриптографии_СертификатыПоИНН(ORGANIZATION_INFO.ИНН);
	Если Сертификаты = Неопределено Тогда
		Возврат РезультатВыполненияМетода(Ложь, "Сертификаты не найдены");
	КонецЕсли;

	ОписаниеСертификатов = Новый Массив();
	Для Каждого ЭлементКоллекции Из Сертификаты Цикл

		ОписаниеСертификата = Новый Структура();
		ОписаниеСертификата.Вставить("ДатаНачалаДействия", ЭлементКоллекции.Сертификат.ДатаНачала);
		ОписаниеСертификата.Вставить("ДатаОкончанияДействия", ЭлементКоллекции.Сертификат.ДатаОкончания);
		ОписаниеСертификата.Вставить("ОтпечатокСертификата", НРег(ПолучитьHexСтрокуИзДвоичныхДанных(
			ЭлементКоллекции.Сертификат.Отпечаток)));

		Если ЭлементКоллекции.Сертификат.Субъект.Свойство("CN") Тогда
			ОписаниеСертификата.Вставить("ЮридическоеЛицо", ЭлементКоллекции.Сертификат.Субъект.CN);
		ИначеЕсли ЭлементКоллекции.Сертификат.Субъект.Свойство("O") Тогда
			ОписаниеСертификата.Вставить("ЮридическоеЛицо", ЭлементКоллекции.Сертификат.Субъект.O);
		ИначеЕсли ЭлементКоллекции.Сертификат.Субъект.Свойство("OID2_5_4_10") Тогда
			ОписаниеСертификата.Вставить("ЮридическоеЛицо", ЭлементКоллекции.Сертификат.Субъект.OID2_5_4_10);
		ИначеЕсли ЭлементКоллекции.Сертификат.Субъект.Свойство("OID2_5_4_3") Тогда
			ОписаниеСертификата.Вставить("ЮридическоеЛицо", ЭлементКоллекции.Сертификат.Субъект.OID2_5_4_3);
		КонецЕсли;

		Если ЭлементКоллекции.Сертификат.Субъект.Свойство("SN") И ЭлементКоллекции.Сертификат.Субъект.Свойство("GN") Тогда
			ОписаниеСертификата.Вставить("ФИО", ЭлементКоллекции.Сертификат.Субъект.SN + " "
				+ ЭлементКоллекции.Сертификат.Субъект.GN);
		ИначеЕсли ЭлементКоллекции.Сертификат.Субъект.Свойство("OID2_5_4_4")
			И ЭлементКоллекции.Сертификат.Субъект.Свойство("OID2_5_4_42") Тогда
			ОписаниеСертификата.Вставить("ФИО", ЭлементКоллекции.Сертификат.Субъект.OID2_5_4_4 + " "
				+ ЭлементКоллекции.Сертификат.Субъект.OID2_5_4_42);
		КонецЕсли;

		ОписаниеСертификатов.Добавить(ОписаниеСертификата);

	КонецЦикла;

	Возврат РезультатВыполненияМетода(Истина, "Выполнено успешно", ОписаниеСертификатов);

КонецФункции

// Возвращает список ящиков организации в сервисе Контур.Диадок.
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - Истина, если ящики получены
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Массив из Структура, Неопределено - описание ящиков:
//         ** НаименованиеЯщика - Строка - наименование ящика
//         ** ИдентификаторЯщика - Строка - идентификатор ящика
Функция ИдентификаторыЯщиков() Экспорт
	
	РезультатНачальнойИнициализации = ПередНачаломВыполненияМетода();
	Если Не РезультатНачальнойИнициализации.Успешно Тогда
		Возврат РезультатНачальнойИнициализации;
	КонецЕсли;

	РезультатВыполнения = GetMyOrganizations();
	Если Не РезультатВыполнения.Успешно Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	MyOrganizations = РезультатВыполнения.Данные;
	
	ИдентификаторыЯщиков = Новый Массив();
	Для Каждого MyOrganization Из MyOrganizations.Organizations Цикл
		Если MyOrganization.inn = ORGANIZATION_INFO.ИНН Тогда
			Для Каждого MyBox Из MyOrganization.Boxes Цикл

				ОписаниеЯщика = Новый Структура();
				ОписаниеЯщика.Вставить("НаименованиеЯщика", MyBox.Title);
				ОписаниеЯщика.Вставить("ИдентификаторЯщика", MyBox.BoxIdGuid);

				ИдентификаторыЯщиков.Добавить(ОписаниеЯщика);

			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Возврат РезультатВыполненияМетода(Истина, "Выполнено успешно", ИдентификаторыЯщиков);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтурHTTP

// Возвращает результат обмена данных авторизации на токен доступа по протоколу OIDC.
//
// Параметры:
//   client_id - Строка - идентификатор клиента
//   client_secret - Строка - секрет клиента
//   refresh_token - Строка - токен обновления
//   grant_type - Строка - тип предоставления доступа
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - Истина, если запрос выполнен успешно
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Произвольный, Неопределено - данные ответа сервиса авторизации
Функция Connect(client_id, client_secret, refresh_token, grant_type = "refresh_token")
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1/connect/token", АдресСервисаАвторизации());
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "POST";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ТелоКакДанные = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ТелоКакДанные.Вставить("client_id", client_id);
	ПараметрыВыполненияМетодаHTTP.ТелоКакДанные.Вставить("client_secret", client_secret);
	ПараметрыВыполненияМетодаHTTP.ТелоКакДанные.Вставить("refresh_token", refresh_token);
	ПараметрыВыполненияМетодаHTTP.ТелоКакДанные.Вставить("grant_type", grant_type);
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

#Область УстаревшиеМетоды

// Возвращает зашифрованный токен аутентификации по сертификату (устаревший способ авторизации).
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - Истина, если запрос выполнен успешно
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Произвольный, Неопределено - токен аутентификации в виде Base64-строки
Функция V3_Authenticate()
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/v3/Authenticate?type=certificate");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "POST";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "БезПреобразования";
	
	ПараметрыВыполненияМетодаHTTP.ТелоКакДанные = Base64Строка(CURRENT_CERTIFICATE.Выгрузить());
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Content-Type", "application/octet-stream");
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки, Истина);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

// Подтверждает аутентификацию и возвращает токен доступа (устаревший способ авторизации).
//
// Параметры:
//   AuthenticateResult - Строка - токен аутентификации, полученный методом V3_Authenticate
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - Истина, если запрос выполнен успешно
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Произвольный, Неопределено - токен доступа
Функция V3_AuthenticateConfirm(AuthenticateResult)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/V3/AuthenticateConfirm");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "POST";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "БезПреобразования";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("token", AuthenticateResult);
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("thumbprint", ORGANIZATION_INFO.ОтпечатокСертификата);
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки, Истина);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

#КонецОбласти

#Область Контрагенты_Организации

Функция V3_GetCounteragent(counteragentBoxId)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/V3/GetCounteragent");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("myBoxId", ИдентификаторЯщика());
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("counteragentBoxId", counteragentBoxId);
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
		
КонецФункции

Функция V2_GetCounteragentCertificates(counteragentBoxId)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/V2/GetCounteragentCertificates");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("myBoxId", ИдентификаторЯщика());
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("counteragentBoxId", counteragentBoxId);
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
		
КонецФункции

Функция GetOrganizationsByInnKpp(inn, kpp = Неопределено, includeRelations = Неопределено)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/GetOrganizationsByInnKpp");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("inn", inn);
	
	Если ЗначениеЗаполнено(kpp) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("kpp", kpp);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(includeRelations) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("includeRelations", includeRelations);
	КонецЕсли;
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
		
КонецФункции

Функция V2_GetOrganizationsByInnList(GetOrganizationsByInnListRequest)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/V2/GetOrganizationsByInnList");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "POST";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("myBoxId", ИдентификаторЯщика());
	
	ПараметрыВыполненияМетодаHTTP.ТелоКакJSON = GetOrganizationsByInnListRequest;
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки, Истина);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

Функция GetBox(boxId)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/GetBox");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("boxId", boxId);
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

Функция GetOrCreateRoamingOrganizationByFnsParticipantId(GetOrCreateRoamingOrganizationByFnsParticipantIdRequest)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/GetOrCreateRoamingOrganizationByFnsParticipantId");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "POST";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("myBoxId", ИдентификаторЯщика());
	
	ПараметрыВыполненияМетодаHTTP.ТелоКакJSON = GetOrCreateRoamingOrganizationByFnsParticipantIdRequest;
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

Функция GetOrganization(
	orgId = Неопределено, 
	boxId = Неопределено, 
	fnsParticipantId = Неопределено, 
	inn = Неопределено, 
	kpp = Неопределено, 
	foreignTaxpayerCode = Неопределено)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/GetOrganization");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	Если ЗначениеЗаполнено(orgId) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("orgId", orgId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(boxId) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("boxId", boxId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(fnsParticipantId) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("fnsParticipantId", fnsParticipantId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(inn) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("inn", inn);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(kpp) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("kpp", kpp);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(foreignTaxpayerCode) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("foreignTaxpayerCode", foreignTaxpayerCode);
	КонецЕсли;
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

#КонецОбласти

// Возвращает список организаций пользователя с их ящиками.
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - Истина, если запрос выполнен успешно
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Произвольный, Неопределено - данные ответа сервиса
Функция GetMyOrganizations()

	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/GetMyOrganizations");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);

КонецФункции

Функция V3_GetCounteragents(counteragentStatus = Неопределено, afterIndexKey = Неопределено, query = Неопределено,
	pageSize = Неопределено)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/V3/GetCounteragents");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("myBoxId", ИдентификаторЯщика());
	
	Если ЗначениеЗаполнено(counteragentStatus) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("counteragentStatus", counteragentStatus);
	КонецЕсли;

	Если ЗначениеЗаполнено(afterIndexKey) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("afterIndexKey", afterIndexKey);
	КонецЕсли;
	
	// Одновременно использовать query и afterIndexKey нельзя
	Если ЗначениеЗаполнено(query) И Не ЗначениеЗаполнено(afterIndexKey) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("query", query);
	КонецЕсли;

	Если ЗначениеЗаполнено(pageSize) Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("pageSize", pageSize);
	КонецЕсли;
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

// Возвращает список документов, отфильтрованный по заданным параметрам.
//
// Параметры:
//   filterCategory - Строка - категория, по которой фильтруется список документов. Обязательный
//   counteragentBoxId - Строка - идентификатор ящика контрагента, используется для фильтрации.
//                       Не имеет смысла для внутренних документов
//   fromDepartmentId - Строка - идентификатор подразделения отправителя, используется для фильтрации.
//                      Имеет смысл только для внутренних документов
//   toDepartmentId - Строка - идентификатор подразделения получателя, используется для фильтрации.
//                    Имеет смысл только для внутренних документов
//   documentNumber - Строка - номер первичного документа
//   timestampFromTicks - Число - метка времени, задающая начальную точку периода фильтрации
//   timestampToTicks - Число - метка времени, задающая конечную точку периода фильтрации
//   fromDocumentDate - Строка - дата документа в формате "ДД.ММ.ГГГГ", задающая начальную точку периода фильтрации
//   toDocumentDate - Строка - дата документа в формате "ДД.ММ.ГГГГ", задающая конечную точку периода фильтрации
//   departmentId - Строка - идентификатор подразделения, в котором производится поиск документов.
//                  Если не указан, поиск производится в головном подразделении
//   excludeSubdepartments - Булево - Истина, если из поиска нужно исключить дочерние подразделения организации
//   afterIndexKey - Строка - ключ для постраничного получения списка найденных документов, указывающий на начало
//                   очередной страницы. Должен быть закодирован в URL-формат
//   sortDirection - Строка - порядок сортировки документов в ответе. Принимает значения
//                   "Ascending" или "Descending". По умолчанию "Ascending"
//   count - Число - максимальное количество элементов на одной странице ответа, от 0 до 100, по умолчанию 100.
//           Не влияет на общее количество найденных документов
//   
//filterCategory
//Параметр filterCategory задается строкой в формате <DocumentType>.<DocumentClass><DocumentStatus>.
//	<DocumentType> задает тип документа и принимает значения:
//		<TypeNamedId> - строковый идентификатор типа документа. Доступные типы можно получить с помощью метода GetDocumentTypes (V3). Например: Invoice, XmlAcceptanceCertificate, Nonformalized и т.п.
//		Any - агрегированный запрос для всех документов в ящике без учета по типу.
//<DocumentClass> задает класс документа и принимает значения:
//	Inbound - только входящие.
//	Outbound - только исходящие.
//	Internal - только внутренние.
//	Proxy - только документы, переданные через промежуточного получателя.
//	Deleted - только документы, помеченные удаленными.
//<DocumentStatus> задает статус документа и принимает значения:
//	Пустое значение - любой документ указанного класса.
//	NotRead - документ не прочитан.
//	NoRecipientSignatureRequest - документ без запроса ответной подписи.
//	WaitingForRecipientSignature - документ в ожидании ответной подписи.
//	WithRecipientSignature - документ с ответной подписью.
//	WithRecipientPartiallySignature - документ с ответной подписью с разногласиями.
//	WithSenderSignature - документ с подписью отправителя.
//	RecipientSignatureRequestRejected - документ с отказом от формирования ответной подписи.
//	WaitingForSenderSignature - документ, требующий подписания и отправки.
//	InvalidSenderSignature - документ с невалидной подписью отправителя, требующий повторного подписания и отправки.
//	InvalidRecipientSignature - документ с невалидной подписью получателя, требующий повторного подписания и отправки.
//	Approved - согласованный документ.
//	Disapproved - документ с отказом согласования.
//	WaitingForResolution - документ, находящийся на согласовании или подписи.
//	SignatureRequestRejected - документ с отказом в запросе подписи сотруднику.
//	Finished - документ с завершенным документооборотом.
//	HaveToCreateReceipt - нужно подписать извещение о получении.
//	NotFinished - документ с незавершенным документооборотом.
//	InvoiceAmendmentRequested - документ, по которому было запрошено уточнение.
//	RevocationIsRequestedByMe - документ, по которому было запрошено аннулирование.
//	RequestsMyRevocation - документ, по которому контрагент запросил аннулирование.
//	RevocationAccepted - аннулированный документ.
//	RevocationRejected - документ, запрос на аннулирование которого был отклонен.
//	RevocationApproved - документ, запрос на аннулирование которого был согласован.
//	RevocationDisapproved - документ с отказом согласования запроса на аннулирование.
//	WaitingForRevocationApprovement - документ, находящийся на согласовании запроса аннулирования.
//	NotRevoked - неаннулированный документ.
//	WaitingForProxySignature - документ в ожидании подписи промежуточного получателя.
//	WithProxySignature - документ с подписью промежуточного получателя.
//	InvalidProxySignature - документ с невалидной подписью промежуточного получателя, требующий повторного подписания и отправки.
//	ProxySignatureRejected - документ с отказом от формирования подписи промежуточным получателем.
//	WaitingForInvoiceReceipt - документ в ожидании получения извещения о получении счета-фактуры.
//	WaitingForReceipt - документ в ожидании получения извещения о получении.
//	RequestsMySignature - документ, по которому контрагент запросил подпись.
//	RoamingNotificationError - документ с ошибкой доставки в роуминге.
//	HaveToCancelTtGisFixation - документ, для которого требуется отмена сведений об отгрузке маркированных товаров.
//
//Примеры строки filterCategory:
//
//	Any.InboundNotRevoked - все входящие неаннулированные документы.
//	XmlTorg12.OutboundWithRecipientSignature - все исходящие формализованные ТОРГ-12, подписанные контрагентом.
//	InvoiceCorrection.OutboundInvoiceAmendmentRequested - все исходящие КСФ, по которым контрагент запросил уточнение.
//
Функция V3_GetDocuments(filterCategory,
	counteragentBoxId = Неопределено,
	fromDepartmentId = Неопределено,
	toDepartmentId = Неопределено,
	documentNumber = Неопределено,
	timestampFromTicks = Неопределено,
	timestampToTicks = Неопределено,
	fromDocumentDate = Неопределено,
	toDocumentDate = Неопределено,
	departmentId = Неопределено,
	excludeSubdepartments = Неопределено,
	afterIndexKey = Неопределено,
	sortDirection = Неопределено,
	count = 100)
	
	ПараметрыВыполненияМетодаHTTP = Контракт_ПараметрыВыполненияМетодаHTTP();
	ПараметрыВыполненияМетодаHTTP.URL = СтрШаблон("%1%2", АдресДиадокAPI(), "/V3/GetDocuments");
	ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET";
	ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson";
	
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL = Новый Структура();
	ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("boxId", ИдентификаторЯщика());
	
	Если counteragentBoxId <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("counteragentBoxId", counteragentBoxId);	
	КонецЕсли;
	
	Если fromDepartmentId <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("fromDepartmentId", fromDepartmentId);	
	КонецЕсли;
	
	Если toDepartmentId <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("toDepartmentId", toDepartmentId);	
	КонецЕсли;
	
	Если documentNumber <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("documentNumber", documentNumber);	
	КонецЕсли;
	
	Если timestampFromTicks <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("timestampFromTicks", timestampFromTicks);	
	КонецЕсли;
	
	Если timestampToTicks <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("timestampToTicks", timestampToTicks);	
	КонецЕсли;
	
	Если fromDocumentDate <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("fromDocumentDate", fromDocumentDate);	
	КонецЕсли;
	
	Если toDocumentDate <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("toDocumentDate", toDocumentDate);	
	КонецЕсли;
	
	Если departmentId <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("departmentId", departmentId);	
	КонецЕсли;
	
	Если excludeSubdepartments <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("excludeSubdepartments", excludeSubdepartments);	
	КонецЕсли;
	
	Если afterIndexKey <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("afterIndexKey", afterIndexKey);	
	КонецЕсли;
	
	Если sortDirection <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("sortDirection", sortDirection);	
	КонецЕсли;
	
	Если count <> Неопределено Тогда
		ПараметрыВыполненияМетодаHTTP.ПараметрыURL.Вставить("count", count);	
	КонецЕсли;
	
	ПараметрыВыполненияМетодаHTTP.Заголовки.Вставить("Accept", "application/json; charset=utf-8");
	
	ДобавитьЗаголовокАвторизации(ПараметрыВыполненияМетодаHTTP.Заголовки);
	
	Возврат ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP);
	
КонецФункции

// Возвращает адрес API сервиса Контур.Диадок.
//
// Возвращаемое значение:
//   Строка - адрес API
Функция АдресДиадокAPI()

	Возврат "https://diadoc-api.kontur.ru";

КонецФункции

// Возвращает адрес сервиса авторизации Контур.
//
// Возвращаемое значение:
//   Строка - адрес сервиса авторизации
Функция АдресСервисаАвторизации()

	Возврат "https://identity.kontur.ru";

КонецФункции

// Добавляет в заголовки запроса заголовок авторизации.
//
// Параметры:
//   Заголовки - Соответствие из КлючИЗначение - заголовки запроса, в которые добавляется заголовок Authorization
//   НачальнаяАвторизация - Булево - Истина, если выполняется начальная авторизация по сертификату
Процедура ДобавитьЗаголовокАвторизации(Заголовки, НачальнаяАвторизация = Ложь)

	ПараметрыСтроки = Новый Структура();

	Если ORGANIZATION_INFO.АвторизацияOIDC Тогда

		Шаблон = "Bearer [ACCESS_TOKEN]";
		ПараметрыСтроки.Вставить("ACCESS_TOKEN", CURRENT_ACCESS_TOKEN.access_token);

	Иначе

		ПараметрыСтроки.Вставить("DDAUTH_API_CLIENT_ID", ORGANIZATION_INFO.КлючРазработчика);
		Если НачальнаяАвторизация Тогда
			Шаблон = "DiadocAuth ddauth_api_client_id=[DDAUTH_API_CLIENT_ID]";
		Иначе
			ПараметрыСтроки.Вставить("ACCESS_TOKEN", CURRENT_ACCESS_TOKEN.access_token);
			Шаблон = "DiadocAuth ddauth_api_client_id=[DDAUTH_API_CLIENT_ID], ddauth_token=[ACCESS_TOKEN]";
		КонецЕсли;

	КонецЕсли;

	Заголовки.Вставить("Authorization", СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыСтроки));

КонецПроцедуры

// Проверяет код состояния ответа и при необходимости фиксирует ошибку или вызывает исключение.
//
// Параметры:
//   Результат - Структура - результат HTTP-запроса, содержащий код состояния и тело ответа
Функция УспешноВыполненМетодHTTP(Результат)
	
	// https://httpwg.org/specs/rfc9110.html#status.2xx
	Возврат Результат.КодСостояния >= 200 
		И Результат.КодСостояния <= 206;
	
КонецФункции

#Область ПрослойкаHTTP

Функция Контракт_ПараметрыВыполненияМетодаHTTP()
	
	Контракт_ПараметрыВыполненияМетодаHTTP = Новый Структура();
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("URL", "");
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("ВидЗапроса", "GET"); // "GET", "POST"
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("ПараметрыURL", Неопределено);
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("ТелоКакJSON", Неопределено);
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("ТелоКакДанные", Неопределено);
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("ВариантПреобразованияРезультата", "КакJson"); // "КакJson", "КакТекст", "БезПреобразования"
	Контракт_ПараметрыВыполненияМетодаHTTP.Вставить("Заголовки", Новый Соответствие());
	
	Возврат Контракт_ПараметрыВыполненияМетодаHTTP;
		
КонецФункции

Функция ВыполнитьМетодHTTP(ПараметрыВыполненияМетодаHTTP)
	
	ДополнительныеПараметры = Модуль_КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.ПараметрыПреобразованияJSON.ПрочитатьВСоответствие = Ложь;
	
	Если ПараметрыВыполненияМетодаHTTP.ПараметрыURL <> Неопределено Тогда
		ДополнительныеПараметры.ПараметрыЗапроса = ПараметрыВыполненияМетодаHTTP.ПараметрыURL;
	КонецЕсли;
		
	Если ПараметрыВыполненияМетодаHTTP.ТелоКакJSON <> Неопределено Тогда
		ДополнительныеПараметры.Json = ПараметрыВыполненияМетодаHTTP.ТелоКакJSON;
	КонецЕсли;
	
	Если ПараметрыВыполненияМетодаHTTP.ТелоКакДанные <> Неопределено Тогда
		ДополнительныеПараметры.Данные = ПараметрыВыполненияМетодаHTTP.ТелоКакДанные;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ПараметрыВыполненияМетодаHTTP.Заголовки Цикл
		ДополнительныеПараметры.Заголовки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Если ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "GET" Тогда
		
		РезультатВыполненияHTTP = Модуль_КоннекторHTTP.Get(
			ПараметрыВыполненияМетодаHTTP.URL,
			Неопределено,
			ДополнительныеПараметры,
			СессияКоннектор);
				
	ИначеЕсли ПараметрыВыполненияМетодаHTTP.ВидЗапроса = "POST" Тогда
		
		РезультатВыполненияHTTP = Модуль_КоннекторHTTP.Post(
			ПараметрыВыполненияМетодаHTTP.URL,
			Неопределено,
			ДополнительныеПараметры, СессияКоннектор);

	КонецЕсли;

	Если Не УспешноВыполненМетодHTTP(РезультатВыполненияHTTP) Тогда
		Возврат РезультатВыполненияМетодаHTTP(Ложь, Модуль_КоннекторHTTP.КакТекст(РезультатВыполненияHTTP));
	КонецЕсли;

	Если ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакJson" Тогда
		
		Данные = Модуль_КоннекторHTTP.КакJson(РезультатВыполненияHTTP,
			ДополнительныеПараметры.ПараметрыПреобразованияJSON);
			
	ИначеЕсли ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "КакТекст" Тогда
		
		Данные = Модуль_КоннекторHTTP.КакТекст(РезультатВыполненияHTTP);
	
	ИначеЕсли ПараметрыВыполненияМетодаHTTP.ВариантПреобразованияРезультата = "БезПреобразования" Тогда
		
		Данные = РезультатВыполненияHTTP.Тело;
	
	Иначе
		
		Данные = РезультатВыполненияHTTP.Тело;
	
	КонецЕсли;

	Возврат РезультатВыполненияМетодаHTTP(Истина, Данные);
	
КонецФункции

Функция РезультатВыполненияМетодаHTTP(Успешно, Данные)
	
	Возврат Новый Структура("Успешно,Данные", Успешно, Данные);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Криптография

// Создает менеджер криптографии с настройками модуля КриптоПро.
//
// Возвращаемое значение:
//   МенеджерКриптографии - менеджер криптографии
Функция МенеджерКриптографии_Новый()
	
	НовыйМенеджерКриптографии = ИзвлечьИзКэша("Криптография.МенеджерКриптографии");
	Если НовыйМенеджерКриптографии <> Неопределено Тогда
		Возврат НовыйМенеджерКриптографии;
	КонецЕсли;
	
	ПутиМодуляКриптографии = Новый Соответствие();
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.Linux_x86,
		"/opt/cprocsp/lib/ia32/libcapi20.so:/opt/cprocsp/lib/ia32/libcapi10.so");
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.Linux_x86_64,
		"/opt/cprocsp/lib/amd64/libcapi20.so:/opt/cprocsp/lib/amd64/libcapi10.so");
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.MacOS_x86,
		"/opt/cprocsp/lib/libcapi20.dylib:/opt/cprocsp/lib/libcapi10.dylib");
	ПутиМодуляКриптографии.Вставить(ТипПлатформы.MacOS_x86_64,
		"/opt/cprocsp/lib/libcapi20.dylib:/opt/cprocsp/lib/libcapi10.dylib");

	СистемнаяИнформация = Новый СистемнаяИнформация();
	ПутьМодуляКриптографии = ПутиМодуляКриптографии[СистемнаяИнформация.ТипПлатформы];
	Если ПутьМодуляКриптографии = Неопределено Тогда
		ПутьМодуляКриптографии = "";
	КонецЕсли;

	НовыйМенеджерКриптографии = Новый МенеджерКриптографии("", ПутьМодуляКриптографии, 80);

	Если ЗначениеЗаполнено(CURRENT_CERTIFICATE_PASSWORD) Тогда
		НовыйМенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = CURRENT_CERTIFICATE_PASSWORD;
	КонецЕсли;
	
	ПоместитьВКэш("Криптография.МенеджерКриптографии", НовыйМенеджерКриптографии);
	
	Возврат НовыйМенеджерКриптографии;

КонецФункции

// Подписывает двоичные данные сертификатом текущей организации.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - данные для подписи
//
// Возвращаемое значение:
//   ДвоичныеДанные - подпись
Функция МенеджерКриптографии_Подписать(ДвоичныеДанные)

	МенеджерКриптографии = МенеджерКриптографии_Новый();
	Возврат МенеджерКриптографии.Подписать(ДвоичныеДанные, CURRENT_CERTIFICATE);

КонецФункции

// Расшифровывает двоичные данные сертификатом текущей организации.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - данные для расшифровки
//
// Возвращаемое значение:
//   ДвоичныеДанные - расшифрованные данные
Функция МенеджерКриптографии_Расшифровать(ДвоичныеДанные)

	МенеджерКриптографии = МенеджерКриптографии_Новый();
	Возврат МенеджерКриптографии.Расшифровать(ДвоичныеДанные, CURRENT_CERTIFICATE);

КонецФункции

// Возвращает сертификат из хранилища по его отпечатку.
//
// Параметры:
//   ОтпечатокСертификата - Строка, ДвоичныеДанные - отпечаток сертификата
//
// Возвращаемое значение:
//   СертификатКриптографии - найденный сертификат
//   - Неопределено - если сертификат не найден или не указан отпечаток
Функция МенеджерКриптографии_СертификатПоОтпечатку(Знач ОтпечатокСертификата)

	Если ТипЗнч(ОтпечатокСертификата) = Тип("Строка") Тогда
		
		Если ПустаяСтрока(ОтпечатокСертификата) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ОтпечатокСертификата = ПолучитьДвоичныеДанныеИзHexСтроки(ОтпечатокСертификата);
		
	КонецЕсли;

	Попытка

		МенеджерКриптографии = МенеджерКриптографии_Новый();
		ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов(
			ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		Сертификат = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);

	Исключение
		Сертификат = Неопределено;
	КонецПопытки;

	Возврат Сертификат;

КонецФункции

// Возвращает сертификаты организации, найденные по ИНН, отсортированные по дате окончания действия.
//
// Параметры:
//   ИНН - Строка - ИНН организации
//
// Возвращаемое значение:
//   ТаблицаЗначений - сертификаты:
//     * Сертификат - СертификатКриптографии - сертификат
//     * ДатаОкончания - Дата - дата окончания действия сертификата
//   - Неопределено - если сертификаты не найдены
Функция МенеджерКриптографии_СертификатыПоИНН(ИНН)

	МенеджерКриптографии = МенеджерКриптографии_Новый();
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов(
		ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);

	СертификатыПоСубъекту = ХранилищеСертификатовКриптографии.НайтиПоСубъекту(ИНН);
	Если СертификатыПоСубъекту.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Заполняем ТаблицаЗначений для сортировки
	Сертификаты = Новый ТаблицаЗначений();
	Сертификаты.Колонки.Добавить("Сертификат");
	Сертификаты.Колонки.Добавить("ДатаОкончания");

	Для Каждого Сертификат Из СертификатыПоСубъекту Цикл

		НоваяСтрока = Сертификаты.Добавить();
		НоваяСтрока.Сертификат = Сертификат;
		НоваяСтрока.ДатаОкончания = Сертификат.ДатаОкончания;

	КонецЦикла;

	Сертификаты.Сортировать("ДатаОкончания УБЫВ");

	Возврат Сертификаты;

КонецФункции

// Возвращает сертификат организации с наиболее поздней датой окончания действия.
//
// Параметры:
//   ИНН - Строка - ИНН организации
//
// Возвращаемое значение:
//   СертификатКриптографии - найденный сертификат
//   - Неопределено - если сертификат не найден
Функция МенеджерКриптографии_СертификатПоИНН(ИНН)

	Сертификаты = МенеджерКриптографии_СертификатыПоИНН(ИНН);
	Если Сертификаты = Неопределено Тогда
		Возврат Сертификаты;
	КонецЕсли;

	Возврат ?(Сертификаты.Количество(), Сертификаты[0].Сертификат, Неопределено);

КонецФункции

#КонецОбласти

#Область Окружение

// Сбрасывает переменные окружения модуля.
Процедура ОчиститьОкружение()

	СессияКоннектор = Неопределено;

	CURRENT_ORGANIZATION = Неопределено;
	CURRENT_CERTIFICATE = Неопределено;
	CURRENT_CERTIFICATE_PASSWORD = Неопределено;

	CURRENT_ACCESS_TOKEN = Неопределено;

	ORGANIZATION_INFO = Неопределено;

КонецПроцедуры

// Инициализирует переменные окружения модуля для текущей организации.
Процедура ИнициализироватьОкружение()
	
	// Уже инициализировано
	Если CURRENT_ORGANIZATION = Организация Тогда
		Возврат;
	КонецЕсли;

	ОчиститьОкружение();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ВызватьИсключение(НСтр("ru = 'Не указана организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КонецЕсли;

	CURRENT_ORGANIZATION = Организация;
	CURRENT_ACCESS_TOKEN = ИзвлечьТокен();
	ORGANIZATION_INFO = ИзвлечьИнформациюИнтеграции();

	CURRENT_CERTIFICATE_PASSWORD = ORGANIZATION_INFO.ПарольСертификата;

	Если ЗначениеЗаполнено(ORGANIZATION_INFO.ОтпечатокСертификата) Тогда

		CURRENT_CERTIFICATE = МенеджерКриптографии_СертификатПоОтпечатку(ORGANIZATION_INFO.ОтпечатокСертификата);

	ИначеЕсли ЗначениеЗаполнено(ORGANIZATION_INFO.ИНН) Тогда

		CURRENT_CERTIFICATE = МенеджерКриптографии_СертификатПоИНН(ORGANIZATION_INFO.ИНН);

	КонецЕсли;

КонецПроцедуры

// Возвращает идентификатор ящика текущей организации.
//
// Возвращаемое значение:
//   Строка - идентификатор ящика
//   - Неопределено - если ящик не найден
Функция ИдентификаторЯщика()

	Если Не ЗначениеЗаполнено(ORGANIZATION_INFO.ИдентификаторЯщика) Тогда
		ИдентификаторыЯщиков = ИдентификаторыЯщиков();
		Если ИдентификаторыЯщиков.Успешно И ИдентификаторыЯщиков.Данные.Количество() Тогда

			ORGANIZATION_INFO.ИдентификаторЯщика = ИдентификаторыЯщиков.Данные[0].ИдентификаторЯщика;

		КонецЕсли;
	КонецЕсли;

	Возврат ORGANIZATION_INFO.ИдентификаторЯщика;

КонецФункции

#Область Контракты

// Возвращает структуру с данными организации для настройки интеграции.
//
// Возвращаемое значение:
//   Структура - данные организации:
//     * ОтпечатокСертификата - Неопределено - отпечаток сертификата
//     * ПарольСертификата - Неопределено - пароль к закрытому ключу сертификата
//     * АвторизацияOIDC - Булево - признак использования авторизации OIDC
//     * ДанныеАвторизацииOIDC - Структура - данные авторизации OIDC:
//         ** refresh_token - Неопределено - токен обновления
//         ** client_id - Неопределено - идентификатор клиента
//         ** client_secret - Неопределено - секрет клиента
//     * КлючРазработчика - Неопределено - ключ разработчика (для устаревшего варианта авторизации)
//     * ИдентификаторЯщика - Неопределено - идентификатор ящика
//     * ИНН - Неопределено - ИНН организации
Функция Контракт_ORGANIZATION_INFO() Экспорт

	ДанныеАвторизацииOIDC = Новый Структура();
	ДанныеАвторизацииOIDC.Вставить("refresh_token", Неопределено);
	ДанныеАвторизацииOIDC.Вставить("client_id", Неопределено);
	ДанныеАвторизацииOIDC.Вставить("client_secret", Неопределено);

	НовыйКонтракт = Новый Структура();
	НовыйКонтракт.Вставить("ОтпечатокСертификата", Неопределено);
	НовыйКонтракт.Вставить("ПарольСертификата", Неопределено);
	НовыйКонтракт.Вставить("АвторизацияOIDC", Истина); // Актуальный на данный момент
	НовыйКонтракт.Вставить("ДанныеАвторизацииOIDC", ДанныеАвторизацииOIDC);
	НовыйКонтракт.Вставить("КлючРазработчика", Неопределено); // Для устаревшего варианта авторизации
	НовыйКонтракт.Вставить("ИдентификаторЯщика", Неопределено);

	НовыйКонтракт.Вставить("ИНН", Неопределено);

	Возврат НовыйКонтракт;

КонецФункции

// Возвращает структуру токена доступа с пустыми значениями.
//
// Возвращаемое значение:
//   Структура - токен доступа:
//     * access_token - Неопределено - токен доступа
//     * expire_date - Дата - дата истечения срока действия токена
Функция Контракт_CURRENT_ACCESS_TOKEN()

	Возврат Новый Структура("access_token,expire_date", Неопределено, '00010101');

КонецФункции

#КонецОбласти

#Область УправлениеТокенами

// Сохраняет токен доступа в безопасное хранилище.
Процедура СохранитьТокен()
	
	// {Переопределить сохранение токена}

	ПривилегированныйРежимДоУстановки = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);

	Попытка
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(CURRENT_ORGANIZATION, CURRENT_ACCESS_TOKEN,
			"Контур_ПрограммныйИнтерфейс_ТокенДоступа");
	Исключение
		Если Не ПривилегированныйРежимДоУстановки Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

	Если Не ПривилегированныйРежимДоУстановки Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Функция ИзвлечьТокен()
	
	// {Переопределить получение токена}

	ПривилегированныйРежимДоУстановки = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ДанныеБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			CURRENT_ORGANIZATION, "Контур_ПрограммныйИнтерфейс_ТокенДоступа");
	Исключение
		Если Не ПривилегированныйРежимДоУстановки Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

	Если Не ПривилегированныйРежимДоУстановки Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Возврат ?(ДанныеБезопасногоХранилища = Неопределено, Контракт_CURRENT_ACCESS_TOKEN(), ДанныеБезопасногоХранилища);

КонецФункции

Функция ИзвлечьИнформациюИнтеграции()

	// {Переопределить получение информации по интеграции}
	ПривилегированныйРежимДоУстановки = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ДанныеБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			CURRENT_ORGANIZATION, "Контур_ПрограммныйИнтерфейс_ДанныеОрганизации");
	Исключение
		Если Не ПривилегированныйРежимДоУстановки Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Если Не ПривилегированныйРежимДоУстановки Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Возврат ?(ДанныеБезопасногоХранилища = Неопределено, Контракт_ORGANIZATION_INFO(), ДанныеБезопасногоХранилища);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область Кэш

// Помещает данные в кэш по составному ключу.
//
// Параметры:
//   КлючКэша - Строка - ключ вида "КлючУровняКэша1.КлючУровняКэша2.КлючУровняКэша3"
//   Данные - Произвольный - значение, помещаемое в кэш
Процедура ПоместитьВКэш(КлючКэша, Данные)
	
	Уровни = СтрРазделить(КлючКэша, ".");
	
	ТекущийУзел = КЭШ;
	Для Индекс = 0 По Уровни.ВГраница() - 1 Цикл
		СледующийУзел = ТекущийУзел.Получить(Уровни[Индекс]);
		Если СледующийУзел = Неопределено Тогда
			СледующийУзел = Новый Соответствие();
			ТекущийУзел.Вставить(Уровни[Индекс], СледующийУзел);
		КонецЕсли;
		ТекущийУзел = СледующийУзел;
	КонецЦикла;
	
	ТекущийУзел.Вставить(Уровни[Уровни.ВГраница()], Данные);
	
КонецПроцедуры

// Возвращает данные из кэша по составному ключу.
//
// Параметры:
//   КлючКэша - Строка - ключ вида "КлючУровняКэша1.КлючУровняКэша2.КлючУровняКэша3"
//
// Возвращаемое значение:
//   Произвольный, Неопределено - значение из кэша или Неопределено, если данных нет
Функция ИзвлечьИзКэша(КлючКэша)
	
	Уровни = СтрРазделить(КлючКэша, ".");
	
	ТекущийУзел = КЭШ;
	Для Индекс = 0 По Уровни.ВГраница() - 1 Цикл
		ТекущийУзел = ТекущийУзел.Получить(Уровни[Индекс]);
		Если ТекущийУзел = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекущийУзел.Получить(Уровни[Уровни.ВГраница()]);
	
КонецФункции

#КонецОбласти

// Формирует структуру результата выполнения метода.
//
// Параметры:
//   Успешно - Булево - признак успешного выполнения
//   ПредставлениеПользователю - Строка - текст сообщения для пользователя
//   Данные - Произвольный - данные результата
//
// Возвращаемое значение:
//   Структура - результат выполнения:
//     * Успешно - Булево - признак успешного выполнения
//     * ПредставлениеПользователю - Строка - текст сообщения для пользователя
//     * Данные - Произвольный, Неопределено, Строка, Массив - данные результата
//@skip-check doc-comment-collection-item-type
Функция РезультатВыполненияМетода(Успешно, ПредставлениеПользователю = "", Данные = Неопределено)

	Возврат Новый Структура("Успешно,ПредставлениеПользователю,Данные", Успешно, ПредставлениеПользователю, Данные);

КонецФункции

// Преобразует результат HTTP-слоя в результат выполнения метода программного интерфейса.
//
// Параметры:
//   РезультатHTTP - Структура - результат выполнения метода HTTP-слоя, см. РезультатВыполненияМетодаHTTP
//   ТекстУспеха - Строка - (необязательный) текст сообщения при успешном выполнении
//
// Возвращаемое значение:
//   Структура - результат выполнения, см. РезультатВыполненияМетода
Функция РезультатHttpВРезультатМетода(РезультатHTTP, ТекстУспеха = "Выполнено успешно")
	
	Если РезультатHTTP.Успешно Тогда
		Возврат РезультатВыполненияМетода(Истина, ТекстУспеха, РезультатHTTP.Данные);
	КонецЕсли;
	
	Возврат РезультатВыполненияМетода(Ложь, РезультатHTTP.Данные);
	
КонецФункции

// Инициализирует окружение и при необходимости продлевает токен доступа перед выполнением метода.
//
// Параметры:
//   ПродлеватьТокен - Булево - Истина, если нужно продлить токен при его истечении
Функция ПередНачаломВыполненияМетода(ПродлеватьТокен = Истина)

	ИнициализироватьОкружение();

	Если CURRENT_ACCESS_TOKEN.expire_date < ТекущаяДатаСеанса() И ПродлеватьТокен Тогда
		Возврат Авторизоваться();
	КонецЕсли;
	
	Возврат РезультатВыполненияМетода(Истина);

КонецФункции

Функция ТикиВДату(Тики) 
	
	Возврат XMLЗначение(Тип("Дата"), XMLСтрока('00010101' + Тики / 1000 / 1000 / 10));
	
КонецФункции

Функция ДатаВТики(Дата)
	
	Возврат Формат((Дата(Дата) - '00010101') * 1000 * 1000 * 10, "ЧГ=");
	
КонецФункции

#КонецОбласти

#Область Инициализация

КЭШ = Новый Соответствие();
КЭШ.Вставить("Криптография", Неопределено);

Если Модуль_КоннекторHTTP = Неопределено Тогда

	ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий();
	ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;

	АдресВХранилище = ПоместитьВоВременноеХранилище(ПолучитьМакет("КоннекторHTTP"),
		Новый УникальныйИдентификатор("dd8936d1-8659-4e02-91cf-2f0777f33be1"));
	ИмяЭкземпляра = ВнешниеОбработки.Подключить(АдресВХранилище, "КоннекторHTTP", Ложь, ЗащитаОтОпасныхДействий, );

	Модуль_КоннекторHTTP = ВнешниеОбработки.Создать(ИмяЭкземпляра, Ложь, ЗащитаОтОпасныхДействий);

КонецЕсли;

#КонецОбласти

#КонецЕсли